Andrew0050/DP_STM32G474_StateM_20241107/Core/Src/function.c
/** ===================================================================
**     Function Name : void Button_Task(void)
**     Description    : The state of seven buttons

PWM Functionality:

TA1 -> Positive duty cycle 48%
TB1 -> Positive duty cycle 48%
TA2 -> Positive duty cycle 48%
TB2 -> Positive duty cycle 48%

TA1 and TB1 waveforms are complementary, TA2 and TB2 waveforms are complementary
-> When TA1 duty cycle is 48%, TB1 duty cycle is 52%
-> When TA2 duty cycle is 48%, TB2 duty cycle is 52%

TA1 and TA2 waveforms are identical, TB1 and TB2 waveforms are identical
TA1 and TB1 waveforms are complementary, TA2 and TB2 waveforms are complementary

1. TA1 and TB1 are complementary
2. TA2 and TB2 are complementary 
3. Dead time between TA1 and TB1 is between 2% and 50%, cannot be less than 2%
4. Dead time between TA2 and TB2 is between 2% and 50%, cannot be less than 2%
5. Initial frequency is 100KHz
6. Duty cycle is 50%

;---
Button Function Description:

1. PA6 -> Increase frequency of T1, TB1, TA2, TB2 simultaneously
          -> Upper limit 125K

2. PA7 -> Decrease frequency of T1, TB1, TA2, TB2 simultaneously
          -> Lower limit 77K

3. PB4 -> Increase dead time of TA1, TB1
           -> Upper limit 2%, calculated as 50-48 = 2%

4. PB5 -> Decrease dead time of TA1, TB1
           -> Lower limit 10%, calculated as 50-40 = 10%

5. PB6 -> Increase duty cycle of TA2, TB2 simultaneously
            -> Upper limit 48%

6. PB7  -> Decrease duty cycle of TA2, TB2 simultaneously
            -> Minimum to 0%

7. PB9  -> Switch operating mode
            -> Open loop / Closed loop

Button Function Description:
1. KEY1 increases frequency by 1% each time it is pressed
2. KEY2 decreases frequency by 1% each time it is pressed
3. KEY3 increases dead time by 1% each time it is pressed
4. KEY4 decreases dead time by 1% each time it is pressed
5. KEY5 increases duty cycle by 1% each time it is pressed
6. KEY6 decreases duty cycle by 1% each time it is pressed
7. KEY7 switches mode / open-loop or closed-loop

**     Parameters  :
**     Returns     :
** ===================================================================*/


#include "function.h"
#include "CtlLoop.h"
#include "stdio.h"
#include "string.h"

#include "stm32g4xx_hal_def.h"

//#include "hrtim.h"
// Soft-start state flag
SState_M STState = SSInit;

// OLED refresh counter, increments every 5ms in the 5ms interrupt
uint16_t OLEDShowCnt = 0;


// Define control modes
#define MODE_OPEN 0
#define MODE_CLOSE 1

// Minimum and maximum frequencies (Unit: Hz)
#define FREQ_MIN 70000.0f    // 70 kHz
#define FREQ_MAX 130000.0f   // 130 kHz
#define FREQ_STEP_PERCENT 0.1f  // Frequency adjustment step per button press: 0.1%

// Dead time parameters (Unit: 0.1%, each step adjusts by 0.1%)
#define DEADTIME_MIN_PX1000 0     // 0%
#define DEADTIME_MAX_PX1000 50    // 5.0%
#define DEADTIME_STEP_PX1000 1    // 0.1%

// Duty cycle parameters (Unit: 0.1%, each step adjusts by 0.1%)
#define DUTY_MIN_PX10 50    // 5.0%
#define DUTY_MAX_PX10 500   // 50.0%
#define DUTY_STEP_PX10 1     // 0.1%

// Assume CNTR_MIN and CNTR_MAX are defined as follows
#define CNTR_MIN 1000
#define CNTR_MAX 16000

// Global variables
extern HRTIM_HandleTypeDef hhrtim1;
extern HRTIM_TimeBaseCfgTypeDef pGlobalTimeBaseCfg;

volatile float currentPWMFreq = 100000.0f;        // Initial frequency 100 kHz
volatile uint8_t gCurrentDeadTimePercent = 2;     // Initial dead time 2%

// Initialize duty cycles
volatile uint8_t gCurrentDutyPercent_TA1_TB1 = 48; // Initial duty cycle for TA1/TB1 is 48%
volatile uint8_t gCurrentDutyPercent_TA2_TB2 = 48; // Initial duty cycle for TA2/TB2 is 48%

// Time base configuration structure
HRTIM_TimeBaseCfgTypeDef pGlobalTimeBaseCfg;

// Current PLL frequency
volatile uint32_t currentPLLFreq = 160000000;      // 160 MHz, set according to fHRCK




/** ===================================================================
**     Funtion Name :void Key_Scan(void)
**     Description : The state of two buttons
**       Default state of KEYFlag is 0. When pressed, Flag becomes 1, and when pressed again, Flag becomes 0, cycling in this way.
**       When the machine is running normally or during startup, pressing the button will turn off the output and enter standby mode.
**     Parameters  :
**     Returns     :
** ===================================================================*/
uint8_t Key_Scan(GPIO_TypeDef* GPIOx,uint16_t GPIO_Pin)
{			
	/* Check if the button is pressed */
	if(HAL_GPIO_ReadPin(GPIOx, GPIO_Pin) == KEY_OFF)  
	{	 
		/* Wait for the button to be released */
		while(HAL_GPIO_ReadPin(GPIOx,GPIO_Pin) == KEY_OFF);   
		return 	KEY_ON;	 
	}
	else
		return KEY_OFF;

}


/** ===================================================================
**     Funtion Name : Button_Task
**     Description : 
**     Parameters  :
**     Returns     :
** ===================================================================*/

void Button_Task(void)
{
	// KEY1/PA6 : Simultaneously increase frequency of T1, TB1, TA2, TB2
	if (Key_Scan(KEY1_INC_Freq_GPIO_Port, KEY1_INC_Freq_Pin) == KEY_ON)
	{
		if (currentPWMFreq < FREQ_MAX)
		{
			currentPWMFreq *= (1.0f + (FREQ_STEP_PERCENT / 100.0f)); // Increase by 0.1%
			if (currentPWMFreq > FREQ_MAX)
				currentPWMFreq = FREQ_MAX;

			// Update HRTIM frequency
			if (SetPWMFrequency((uint32_t)currentPWMFreq) != HAL_OK) {
				// Handle error
				Error_Handler();
			}
			HAL_GPIO_TogglePin(TEST_LED_GPIO_Port, TEST_LED_Pin);
		}
	}
	
	// KEY2/PA7 : Simultaneously decrease frequency of T1, TB1, TA2, TB2
	if (Key_Scan(KEY2_DEC_Freq_GPIO_Port, KEY2_DEC_Freq_Pin) == KEY_ON)
	{
		if (currentPWMFreq > FREQ_MIN)
		{
			currentPWMFreq *= (1.0f - (FREQ_STEP_PERCENT / 100.0f)); // Decrease by 0.1%
			if (currentPWMFreq < FREQ_MIN)
				currentPWMFreq = FREQ_MIN;

			// Update HRTIM frequency
			if (SetPWMFrequency((uint32_t)currentPWMFreq) != HAL_OK) {
				// Handle error
				Error_Handler();
			}
			HAL_GPIO_TogglePin(TEST_LED_GPIO_Port, TEST_LED_Pin);
		}
	}

    // KEY3/PB4: Increase dead time of TA1/TB1
    if (Key_Scan(KEY3_INC_DT_GPIO_Port, KEY3_INC_DT_Pin) == KEY_ON)
    {
		if (gCurrentDeadTimePercent < 50)
		{
			gCurrentDeadTimePercent += 1; // Increase by 0.1%

			if (gCurrentDeadTimePercent > 50)
				gCurrentDeadTimePercent = 50;

				// Manually adjust dead time
				SetDeadTimeManual(gCurrentDeadTimePercent);

