Andrew0050/DP_STM32G474_StateM_20241107/Core/Src/function.c
				// Display dead time
				DisplayDeadTime((float)gCurrentDeadTimePercent * 0.1f);

				HAL_GPIO_TogglePin(TEST_LED_GPIO_Port, TEST_LED_Pin); 
		}
    }

	// KEY4/PB5: Decrease dead time of TA1/TB1
    if (Key_Scan(KEY4_DEC_DT_GPIO_Port, KEY4_DEC_DT_Pin) == KEY_ON)
    {
		if (gCurrentDeadTimePercent > 0)
		{
			gCurrentDeadTimePercent -= 1; // Decrease by 0.1%

			//if (gCurrentDeadTimePercent < 1)
			//	gCurrentDeadTimePercent = 1;

					// Manually adjust dead time
					SetDeadTimeManual(gCurrentDeadTimePercent);

					// Display dead time
					DisplayDeadTime((float)gCurrentDeadTimePercent * 0.1f);


					HAL_GPIO_TogglePin(TEST_LED_GPIO_Port, TEST_LED_Pin); 
			}
    }

	// KEY5/PB6: Simultaneously increase duty cycle of TA2/TB2
    if (Key_Scan(KEY5_INC_DUTY_GPIO_Port, KEY5_INC_DUTY_Pin) == KEY_ON)
    {
		if (gCurrentDutyPercent_TA2_TB2 < 50)
		{
			gCurrentDutyPercent_TA2_TB2 += 1; // Increase by 0.1%

			//if (gCurrentDutyPercent_TA2_TB2 > 45)
			//	gCurrentDutyPercent_TA2_TB2 = 45;
	
				// Update duty cycle
				//if (SetDutyCycle_TA2_TB2(gCurrentDutyPercent_TA2_TB2) != HAL_OK) {
					// Handle error
				//	Error_Handler();
				//}

					// Display duty cycle
					DisplayDutyCycle(gCurrentDutyPercent_TA2_TB2);

					HAL_GPIO_TogglePin(TEST_LED_GPIO_Port, TEST_LED_Pin); 
			}
    }
	// KEY6/PB7: Simultaneously decrease duty cycle of TA2/TB2
    if (Key_Scan(KEY6_DEC_DUTY_GPIO_Port, KEY6_DEC_DUTY_Pin) == KEY_ON)
    {
			if (gCurrentDutyPercent_TA2_TB2 > 0)
			{
				gCurrentDutyPercent_TA2_TB2 -= 1; // Decrease by 0.1%

				//if (gCurrentDutyPercent_TA2_TB2 < 5)
				//	gCurrentDutyPercent_TA2_TB2 = 5;
	
				// Update duty cycle
				//if (SetDutyCycle_TA2_TB2(gCurrentDutyPercent_TA2_TB2) != HAL_OK) {
					// Handle error
				//	Error_Handler();
				//}
					// Display duty cycle
					DisplayDutyCycle(gCurrentDutyPercent_TA2_TB2);

					HAL_GPIO_TogglePin(TEST_LED_GPIO_Port, TEST_LED_Pin); // Toggle LED
			}
    }

    // KEY7/PB9: Switch operating mode
    if (Key_Scan(KEY7_SWITCH_MODE_GPIO_Port, KEY7_SWITCH_MODE_Pin) == KEY_ON)
    {
		Mode_Switch(); // Switch mode
    }
	// Update OLED display
	UpdateDisplay();

}


/** ===================================================================
**     Function Name : SetPWMFrequency
**     Description : 
    
Currently using 100MHz for prescaling, timebase = 16000 = 100KHz
Mid-cycle point 50% = 8000

1. Duty cycle cannot exceed 50%
2. Frequency upper limit is 130KHz, lower limit is 70KHz
3. Dead time upper limit is 2%
    
**     Parameters  :req_tim_freq - Requested PWM frequency (Hz).
**     Returns     :HAL_StatusTypeDef - Returns HAL_OK on success, HAL_ERROR on failure.
** ===================================================================*/
HAL_StatusTypeDef SetPWMFrequency(uint32_t req_tim_freq) {
    uint32_t prescaler_value;
    uint32_t fHRCK;
    uint32_t period;

    // Define frequency range
    if (req_tim_freq < FREQ_MIN || req_tim_freq > FREQ_MAX) {
        return HAL_ERROR; // Frequency out of range
    }

    if (req_tim_freq >= 100000) {
        // Use prescaler = MUL16
        prescaler_value = 16;
        fHRCK = 100000000UL * prescaler_value; // 100MHz * 16 = 1.6GHz
    } else {
        // Use prescaler = MUL8
        prescaler_value = 8;
        fHRCK = 100000000UL * prescaler_value; // 100MHz * 8 = 800MHz (adjust according to actual clock configuration)
    }

    // Calculate new Period
    period = fHRCK / req_tim_freq;

    // Verify if Period is within allowed range
    if (period < CNTR_MIN || period > CNTR_MAX) {
        return HAL_ERROR;
    }

    // Update global time base configuration's Period and PrescalerRatio
    pGlobalTimeBaseCfg.Period = period;
    if (prescaler_value == 16) {
        pGlobalTimeBaseCfg.PrescalerRatio = HRTIM_PRESCALERRATIO_MUL16;
    } else if (prescaler_value == 8) {
        pGlobalTimeBaseCfg.PrescalerRatio = HRTIM_PRESCALERRATIO_MUL8;
    } else {
        return HAL_ERROR; // Unsupported prescaler
    }

    // Configure Timer A's time base
    if (HAL_HRTIM_TimeBaseConfig(&hhrtim1, HRTIM_TIMERINDEX_TIMER_A, &pGlobalTimeBaseCfg) != HAL_OK) {
        return HAL_ERROR;
    }

    // Configure Timer B's time base
    if (HAL_HRTIM_TimeBaseConfig(&hhrtim1, HRTIM_TIMERINDEX_TIMER_B, &pGlobalTimeBaseCfg) != HAL_OK) {
        return HAL_ERROR;
    }

    // Configure Compare Unit 2 as midpoint value (50% duty cycle)
    HRTIM_CompareCfgTypeDef pCompareCfg = {0};
    pCompareCfg.CompareValue = (period / 2) - 1;
    pCompareCfg.AutoDelayedMode = HRTIM_AUTODELAYEDMODE_REGULAR;
    pCompareCfg.AutoDelayedTimeout = 0x0000;

    // Configure Timer A's Compare Unit 2
    if (HAL_HRTIM_WaveformCompareConfig(&hhrtim1, HRTIM_TIMERINDEX_TIMER_A, HRTIM_COMPAREUNIT_2, &pCompareCfg) != HAL_OK) {
        return HAL_ERROR;
    }

    // Configure Timer B's Compare Unit 2
    if (HAL_HRTIM_WaveformCompareConfig(&hhrtim1, HRTIM_TIMERINDEX_TIMER_B, HRTIM_COMPAREUNIT_2, &pCompareCfg) != HAL_OK) {
        return HAL_ERROR;
    }

    // Software reset HRTIM's Timer A and Timer B to apply new settings
    if (HAL_HRTIM_SoftwareReset(&hhrtim1, HRTIM_TIMERRESET_TIMER_A | HRTIM_TIMERRESET_TIMER_B) != HAL_OK) {
        return HAL_ERROR;
    }

    // Update global frequency variables
    currentPWMFreq = req_tim_freq;
    currentPLLFreq = fHRCK;

    return HAL_OK;
}


/**
  * @brief  Manually set dead time.
  * @param  dead_time_percent - New dead time (unit: 0.1%).
  * @retval None
  */
void SetDeadTimeManual(uint8_t dead_time_percent)
{
    // Ensure dead time is within allowed range
    if (dead_time_percent > DEADTIME_MAX_PX1000) {
        return;
    }

    uint32_t period = pGlobalTimeBaseCfg.Period;
    uint32_t dead_time_ticks = (period * dead_time_percent) / 1000; // 0.1% = 1/1000

    // Adjust Timer A Compare Unit 2 (midpoint) for TA1's ResetSource
    HRTIM_CompareCfgTypeDef compareConfigA = {0};
    compareConfigA.CompareValue = dead_time_ticks;
    compareConfigA.AutoDelayedMode = HRTIM_AUTODELAYEDMODE_REGULAR;
    compareConfigA.AutoDelayedTimeout = 0x0000;

    if (HAL_HRTIM_WaveformCompareConfig(&hhrtim1, HRTIM_TIMERINDEX_TIMER_A, HRTIM_COMPAREUNIT_2, &compareConfigA) != HAL_OK) {
        Error_Handler();
    }

    // Adjust Timer B Compare Unit 2 (midpoint) for TB1's ResetSource
    HRTIM_CompareCfgTypeDef compareConfigB = {0};
    compareConfigB.CompareValue = period - dead_time_ticks;
    compareConfigB.AutoDelayedMode = HRTIM_AUTODELAYEDMODE_REGULAR;
    compareConfigB.AutoDelayedTimeout = 0x0000;

    if (HAL_HRTIM_WaveformCompareConfig(&hhrtim1, HRTIM_TIMERINDEX_TIMER_B, HRTIM_COMPAREUNIT_2, &compareConfigB) != HAL_OK) {
        Error_Handler();
    }

    // Software reset HRTIM's Timer A and Timer B to apply new settings
    if (HAL_HRTIM_SoftwareReset(&hhrtim1, HRTIM_TIMERRESET_TIMER_A | HRTIM_TIMERRESET_TIMER_B) != HAL_OK) {
        Error_Handler();
    }

    // Start Timer A and Timer B
    if (HAL_HRTIM_WaveformCounterStart(&hhrtim1, HRTIM_TIMERID_TIMER_A | HRTIM_TIMERID_TIMER_B) != HAL_OK) {
        Error_Handler();
    }
}




/**
  * @brief  Set PWM duty cycle for TA1/TB1.
  * @param  duty_percent - New duty cycle (percentage).
  * @retval HAL_StatusTypeDef - Returns HAL_OK on success, HAL_ERROR on failure.
  */
HAL_StatusTypeDef SetDutyCycle_TA1_TB1(uint8_t duty_percent)
{
    if (duty_percent < 5 || duty_percent > 95)
    {
        return HAL_ERROR;
    }

    uint32_t period = pGlobalTimeBaseCfg.Period;
    uint32_t compare_value = (period * duty_percent) / 100;

    // Update Timer A Compare Unit 2 (midpoint) corresponding to TA1's ResetSource
    HRTIM_CompareCfgTypeDef compareConfig = {0};
    compareConfig.CompareValue = compare_value;
    compareConfig.AutoDelayedMode = HRTIM_AUTODELAYEDMODE_REGULAR;
    compareConfig.AutoDelayedTimeout = 0x0000;

    if (HAL_HRTIM_WaveformCompareConfig(&hhrtim1, HRTIM_TIMERINDEX_TIMER_A, HRTIM_COMPAREUNIT_2, &compareConfig) != HAL_OK) {
        return HAL_ERROR;
    }

    if (HAL_HRTIM_WaveformCompareConfig(&hhrtim1, HRTIM_TIMERINDEX_TIMER_B, HRTIM_COMPAREUNIT_2, &compareConfig) != HAL_OK) {
        return HAL_ERROR;
    }

    return HAL_OK;
}


/**
  * @brief  Set PWM duty cycle for TA2/TB2.
  * @param  duty_percent - New duty cycle (percentage).
  * @retval HAL_StatusTypeDef - Returns HAL_OK on success, HAL_ERROR on failure.
  */
HAL_StatusTypeDef SetDutyCycle_TA2_TB2(uint8_t duty_percent)
{
    if (duty_percent < 5 || duty_percent > 45)
    {
        return HAL_ERROR;
    }

    uint32_t period = pGlobalTimeBaseCfg.Period;
    uint32_t compare_value = (period * duty_percent) / 100;

    // Update Timer A Compare Unit 2 (midpoint) corresponding to TA2's ResetSource
    HRTIM_CompareCfgTypeDef compareConfig = {0};
    compareConfig.CompareValue = compare_value;
    compareConfig.AutoDelayedMode = HRTIM_AUTODELAYEDMODE_REGULAR;
    compareConfig.AutoDelayedTimeout = 0x0000;

    if (HAL_HRTIM_WaveformCompareConfig(&hhrtim1, HRTIM_TIMERINDEX_TIMER_A, HRTIM_COMPAREUNIT_2, &compareConfig) != HAL_OK) {
        return HAL_ERROR;
    }

    if (HAL_HRTIM_WaveformCompareConfig(&hhrtim1, HRTIM_TIMERINDEX_TIMER_B, HRTIM_COMPAREUNIT_2, &compareConfig) != HAL_OK) {
        return HAL_ERROR;
    }

    return HAL_OK;
}





