Andrew0050/DP_STM32G474_StateM_20241107/Core/Src/function.c
/*
** ===================================================================
**     Function Name :   void ADCSample(void)
**     Description :    Samples Vin, Iin, Vout, and Iout
**     Parameters  :
**     Returns     :
** ===================================================================
*/

struct _ADI SADC={2048,2048,0,0,2048,2048,0,0,0,0}; // Input and output parameter sampling values and average values
struct _Ctr_value CtrValue={0,0,0,MIN_BUKC_DUTY,0,0,0}; // Control parameters
struct _FLAG DF={0,0,0,0,0,0,0,0}; // Control flag bits
uint16_t ADC1_RESULT[4]={0,0,0,0}; // DMA data storage register for transferring ADC samples from peripheral to memory




CCMRAM void ADCSample(void)
{
	// Declare variables for averaging Vin, Iin, Vout, and Iout
	static uint32_t VinAvgSum=0, IinAvgSum=0, VoutAvgSum=0, IoutAvgSum=0;
	
	// Convert ADC readings using calibration factors (Q15 format), including offset compensation
	SADC.Vin  = ((uint32_t)ADC1_RESULT[0] * CAL_VIN_K >> 12) + CAL_VIN_B;
	SADC.Iin  = ((uint32_t)ADC1_RESULT[1] * CAL_IIN_K >> 12) + CAL_IIN_B;
	SADC.Vout = ((uint32_t)ADC1_RESULT[2] * CAL_VOUT_K >> 12) + CAL_VOUT_B;
	SADC.Iout = ((uint32_t)ADC1_RESULT[3] * CAL_IOUT_K >> 12) + CAL_IOUT_B;

	// Check for invalid readings; if Vin is below the threshold, set it to 0
	if(SADC.Vin < 100) 
		SADC.Vin = 0;
	
	// If Iin is less than 2048, set it to 2048 (0A)
	if(SADC.Iin < 2048) 
		SADC.Iin = 2048;
	
	if(SADC.Vout < 100)
		SADC.Vout = 0;
	
	if(SADC.Iout < 2048)
		SADC.Iout = 2048;

	// Calculate average values of Vin, Iin, Vout, and Iout using moving average
	VinAvgSum = VinAvgSum + SADC.Vin - (VinAvgSum >> 2); // Add current Vin value and subtract the oldest value
	SADC.VinAvg = VinAvgSum >> 2; // Update Vin average
	
	IinAvgSum = IinAvgSum + SADC.Iin - (IinAvgSum >> 2); // Add current Iin value and subtract the oldest value
	SADC.IinAvg = IinAvgSum >> 2; // Update Iin average
	
	VoutAvgSum = VoutAvgSum + SADC.Vout - (VoutAvgSum >> 2); // Add current Vout value and subtract the oldest value
	SADC.VoutAvg = VoutAvgSum >> 2; // Update Vout average
	
	IoutAvgSum = IoutAvgSum + SADC.Iout - (IoutAvgSum >> 2); // Add current Iout value and subtract the oldest value
	SADC.IoutAvg = IoutAvgSum >> 2; // Update Iout average
}



#define MODE_OPEN_LOOP 0
#define MODE_CLOSED_LOOP 1
// Mode variable, default is open-loop mode
volatile uint8_t currentMode = MODE_OPEN_LOOP;

/**
  * @brief  Switch mode function
  * @retval None
  */
void Mode_Switch(void)
{
    if (currentMode == MODE_OPEN_LOOP)
    {
        currentMode = MODE_CLOSED_LOOP;

        // Initialize frequency to 100 kHz
        currentPWMFreq = 100000.0f;
        if (SetPWMFrequency((uint32_t)currentPWMFreq) != HAL_OK)
        {
            Error_Handler();
        }

        // Display mode change
        OLED_ShowStr(55, 0, "Close", 2);
    }
    else
    {
        currentMode = MODE_OPEN_LOOP;

        // Initialize frequency to 100 kHz
        currentPWMFreq = 100000.0f;
        if (SetPWMFrequency((uint32_t)currentPWMFreq) != HAL_OK)
        {
            Error_Handler();
        }


        OLED_ShowStr(55, 0, "      ", 2); // Clear previous display
        OLED_ShowStr(55, 0, "Open", 2);   // Display mode change

		Open_Mode_Init();

    }

    HAL_GPIO_TogglePin(TEST_LED_GPIO_Port, TEST_LED_Pin); // Toggle LED to indicate mode change
}




/**
  * @brief  Update OLED display function
  * @retval None
  */
void UpdateDisplay(void)
{
    // Display different information based on mode
    if (currentMode == MODE_CLOSED_LOOP)
    {
        // Closed-loop mode: Display frequency converted from ADC voltage value

        // Ensure ADC has sampled
		HAL_ADC_Start_DMA(&hadc1, (uint32_t*)ADC1_RESULT, 4); // Start ADC1 sampling, DMA transfer for sampling input/output voltage and current
		HAL_ADC_Start(&hadc1); // Start ADC2 sampling, sampling the sliding potentiometer voltage

        ADCSample();

        // Convert ADC voltage to 0-3.3V
        float adc_voltage = (SADC.VinAvg / 4095.0f) * 3.3f;

        // Calculate corresponding frequency
        // Mid value 1.65V corresponds to 100 kHz
        // Set frequency range from 50 kHz to 150 kHz
        float frequency = 100000.0f + ((adc_voltage - 1.65f) / 1.65f) * 50000.0f; // กำ50 kHz

        // Limit frequency range
        if (frequency < FREQ_MIN)
            frequency = FREQ_MIN;
        if (frequency > FREQ_MAX)
            frequency = FREQ_MAX;

		// Update global frequency variable
		currentPWMFreq = frequency;
		//currentPLLFreq = fHRCK; // Ensure fHRCK is correctly calculated and defined
		
		// Set PWM frequency
		if (SetPWMFrequency((uint32_t)currentPWMFreq) != HAL_OK)
		{
			Error_Handler();
		}
		
		// Display frequency, keeping two decimal places
		unsigned char freqStr[10]; // Changed to unsigned char array
		sprintf((char *)freqStr, "%.2f", currentPWMFreq / 1000.0f); // For example, "100.00KHz"
		
		// Clear previous display area (adjust number of spaces as needed)
		//OLED_ShowStr(45, 2, "		 ", 2); // Clear previous display at (45,2)
		// Display new frequency
		OLED_ShowStr(45, 2, (unsigned char *)(freqStr), 2); // Display current frequency at (45,2)


	 	// Display ADC voltage value
		// Convert ADC voltage to 0-3.3V
		float adc_voltage_display = (SADC.VinAvg / 4095.0f) * 3.3f;
	
		// Convert voltage value to display format (mV)
		uint8_t Vtemp[4] = {0};
		uint32_t Vdisplay = (uint32_t)(adc_voltage_display * 1000.0f); // Convert to mV
	
		Vtemp[0] = (uint8_t)(Vdisplay / 1000);
		Vtemp[1] = (uint8_t)((Vdisplay % 1000) / 100);
		Vtemp[2] = (uint8_t)((Vdisplay % 100) / 10);
		Vtemp[3] = (uint8_t)(Vdisplay % 10);
	
		// Display ADC voltage
		OLEDShowData(50, 6, Vtemp[0]);
		OLEDShowData(65, 6, Vtemp[1]);
		OLEDShowData(75, 6, Vtemp[2]);
		OLEDShowData(85, 6, Vtemp[3]);

    }
    else
    {
        // Open-loop mode: Display manually set frequency

        // Display frequency
        //unsigned char freqStr[10];
        //sprintf(freqStr, "%.1fKHz", currentPWMFreq / 1000.0f);
        //OLED_ShowStr(60, 6, "     ", 2); // Clear previous display
        //OLED_ShowStr(60, 6, freqStr, 2);

		//OLED_ShowStr(50, 6, "	     ", 2); // Clear previous display
		//OLED_ShowStr(30, 6, " STOP   ", 2);   // Display mode change

		//OLED_ShowStr(0, 6, "ADC:", 2);
		//OLED_ShowStr(60, 6, ".", 2);
		//OLED_ShowStr(95, 6, "V", 2);

		// Display frequency, keeping two decimal places
		 unsigned char freqStr[10]; // Use unsigned char
        sprintf((char *)freqStr, "%.2f", currentPWMFreq / 1000.0f); // "100.00KHz"
		//OLED_ShowStr(45, 2, "		 ", 2); // Clear previous display
		OLED_ShowStr(45, 2, freqStr, 2); // Display current frequency
	


