Andrew0050/DP_STM32G474_StateM_20241107/Core/Src/function.c
    }


    // Optional: Display other data, such as Iout, etc.
}



/** ===================================================================
**     Function Name : void MX_OLED_Init(void)
**     Description : OLED initialization routine
**     Initialize the OLED display interface
**     Parameters  :
**     Returns     :
** ===================================================================*/
void Open_Mode_Init(void)
{
	currentMode = MODE_OPEN_LOOP;

	// Initialize the OLED
	OLED_Init();
	OLED_CLS(); // Clear the OLED display
	
	// Display initial text labels on the OLED
	OLED_ShowStr(0, 0, "Mode:", 2);
	OLED_ShowStr(55, 0, "Open", 2);   // Display mode change

	OLED_ShowStr(0, 2, "Freq:", 2);
	OLED_ShowStr(68, 2, ".", 2);
	OLED_ShowStr(100, 2, "KHz", 2);

	OLED_ShowStr(0, 4, "Du/DT:", 2);
	OLED_ShowStr(85, 4, "/", 2);
	OLED_ShowStr(120, 4, "%", 2);

	// Display dead time
	gCurrentDeadTimePercent = 2;
	DisplayDeadTime((float)gCurrentDeadTimePercent);

	// Display duty cycle
	gCurrentDutyPercent_TA2_TB2 = 48;
	DisplayDutyCycle(gCurrentDutyPercent_TA2_TB2);

	OLED_ShowStr(0, 6, "ADC:", 2);
	OLED_ShowStr(60, 6, ".", 2);
	OLED_ShowStr(95, 6, "V", 2);

	// Display ADC voltage
	uint8_t Vtemp[4] = {0};
	OLEDShowData(50, 6, Vtemp[0]);
	OLEDShowData(65, 6, Vtemp[1]);
	OLEDShowData(75, 6, Vtemp[2]);
	OLEDShowData(85, 6, Vtemp[3]);

	OLED_ON(); // Turn on the OLED display
}




/** ===================================================================
**     Function Name : void MX_OLED_Init(void)
**     Description : OLED initialization routine
**     Initialize the OLED display interface
**     Parameters  :
**     Returns     :
** ===================================================================*/
void MX_OLED_Init(void)
{
	// Initialize the OLED
	OLED_Init();
	OLED_CLS(); // Clear the OLED display
	
	// Display initial text labels on the OLED
	OLED_ShowStr(0, 0, "Mode:", 2);

	OLED_ShowStr(0, 2, "ADC:", 2);
	OLED_ShowStr(60, 2, ".", 2);
	OLED_ShowStr(95, 2, "V", 2);

	OLED_ShowStr(0, 4, "Duty:", 2);
	OLED_ShowStr(68, 4, ".", 2);
	OLED_ShowStr(95, 4, "%", 2);

	OLED_ShowStr(0, 6, "Freq:", 2);
	OLED_ShowStr(68, 6, ".", 2);
	OLED_ShowStr(95, 6, "KHz", 2);

	OLED_ON(); // Turn on the OLED display
}



/**
  * @brief  Display Duty Cycle on OLED
  * @param  duty_percent - Current duty cycle percentage (e.g., 36.0 represents 36.0%)
  * @retval None
  */
void DisplayDutyCycle(float duty_percent)
{
    // Limit duty cycle within allowed range
    //if (duty_percent < (float)DUTY_MIN_PX10 / 10.0f)
    //    duty_percent = (float)DUTY_MIN_PX10 / 10.0f;
    //if (duty_percent > (float)DUTY_MAX_PX10 / 10.0f)
    //    duty_percent = (float)DUTY_MAX_PX10 / 10.0f;

    // Format duty cycle string, keeping one decimal place
    unsigned char dutyStr[10];
    sprintf((char *)dutyStr, "%.1f", duty_percent);

    // Display duty cycle, adjust coordinates according to OLED initialization
    // Assume "Duty:" label is at (0,4), value is displayed at (50,4)
    OLED_ShowStr(50, 4, dutyStr, 2); // Adjust x, y coordinates to fit your display layout
}

/**
  * @brief  Display Dead Time on OLED
  * @param  dead_time_percent - Current dead time percentage (e.g., 2.0 represents 2.0%)
  * @retval None
  */
void DisplayDeadTime(float dead_time_percent)
{
    // Limit dead time within allowed range
    //if (dead_time_percent < (float)DEADTIME_MIN_PX1000 / 10.0f)
    //    dead_time_percent = (float)DEADTIME_MIN_PX1000 / 10.0f;
    //if (dead_time_percent > (float)DEADTIME_MAX_PX1000 / 10.0f)
    //    dead_time_percent = (float)DEADTIME_MAX_PX1000 / 10.0f;

    // Format dead time string, keeping one decimal place
    unsigned char deadTimeStr[10];
    sprintf((char *)deadTimeStr, "%.1f", dead_time_percent);

    // Display dead time, adjust coordinates according to OLED initialization
    // Assume "Du/DT:" label is at (0,4), value is displayed at (95,4)
    OLED_ShowStr(95, 4, deadTimeStr, 2); // Adjust x, y coordinates to fit your display layout
}





/**
  * @brief  Update HRTIM PWM frequency
  * @param  period: Timer period
  * @param  half_period: Half period
  * @param  duty_cycle: Duty cycle
  * @param  dead_time: Dead time
  * @retval HAL_StatusTypeDef: Returns HAL_OK on success, HAL_ERROR on failure
  */
void UpdateHRTIM(int period, int half_period, int duty_cycle, int dead_time)
{
    /* USER CODE END HRTIM1_Init 0 */

    HRTIM_TimeBaseCfgTypeDef timeBaseConfig = {0};
    HRTIM_TimerCfgTypeDef timerConfig = {0};
    HRTIM_CompareCfgTypeDef compareConfig = {0};
    HRTIM_TimerCtlTypeDef timerControl = {0};
    HRTIM_OutputCfgTypeDef outputConfig = {0};

    /* USER CODE BEGIN HRTIM1_Init 1 */

    /* USER CODE END HRTIM1_Init 1 */
    hhrtim1.Instance = HRTIM1;
    hhrtim1.Init.HRTIMInterruptResquests = HRTIM_IT_NONE;
    hhrtim1.Init.SyncOptions = HRTIM_SYNCOPTION_NONE;
    if (HAL_HRTIM_Init(&hhrtim1) != HAL_OK)
    {
        Error_Handler();
    }
    if (HAL_HRTIM_DLLCalibrationStart(&hhrtim1, HRTIM_CALIBRATIONRATE_3) != HAL_OK)
    {
        Error_Handler();
    }
    if (HAL_HRTIM_PollForDLLCalibration(&hhrtim1, 10) != HAL_OK)
    {
        Error_Handler();
    }

    // Configure time base for Master timer
    timeBaseConfig.Period = period;
    timeBaseConfig.RepetitionCounter = 0x00; // Set repetition counter to 0
    timeBaseConfig.PrescalerRatio = HRTIM_PRESCALERRATIO_MUL16; // Set prescaler ratio to 16x
    timeBaseConfig.Mode = HRTIM_MODE_CONTINUOUS; // Set timer to continuous mode

    // Apply time base configuration to Master timer, handle error if fails
    if (HAL_HRTIM_TimeBaseConfig(&hhrtim1, HRTIM_TIMERINDEX_MASTER, &timeBaseConfig) != HAL_OK)
    {
        Error_Handler();
    }

    // Configure control parameters for Master timer
    timerConfig.InterruptRequests = HRTIM_MASTER_IT_NONE; // Disable Master timer interrupt requests
    timerConfig.DMARequests = HRTIM_MASTER_DMA_NONE;       // Disable Master timer DMA requests
    timerConfig.DMASrcAddress = 0x0000;                   // Set DMA source address to 0
    timerConfig.DMADstAddress = 0x0000;                   // Set DMA destination address to 0
    timerConfig.DMASize = 0x1;                            // Set DMA transfer size to 1
    timerConfig.HalfModeEnable = HRTIM_HALFMODE_DISABLED; // Disable half mode
    timerConfig.InterleavedMode = HRTIM_INTERLEAVED_MODE_DISABLED; // Disable interleaved mode
    timerConfig.StartOnSync = HRTIM_SYNCSTART_DISABLED;    // Disable synchronous start
    timerConfig.ResetOnSync = HRTIM_SYNCRESET_DISABLED;    // Disable synchronous reset
    timerConfig.DACSynchro = HRTIM_DACSYNC_NONE;           // Disable DAC synchronization
    timerConfig.PreloadEnable = HRTIM_PRELOAD_DISABLED;    // Disable preload
    timerConfig.UpdateGating = HRTIM_UPDATEGATING_INDEPENDENT; // Set update gating to independent
    timerConfig.BurstMode = HRTIM_TIMERBURSTMODE_MAINTAINCLOCK; // Set burst mode to maintain clock
    timerConfig.RepetitionUpdate = HRTIM_UPDATEONREPETITION_DISABLED; // Disable repetition update
    timerConfig.ReSyncUpdate = HRTIM_TIMERESYNC_UPDATE_UNCONDITIONAL; // Set resync update to unconditional

    // Apply Master timer control configuration, handle error if fails
    if (HAL_HRTIM_WaveformTimerConfig(&hhrtim1, HRTIM_TIMERINDEX_MASTER, &timerConfig) != HAL_OK)
    {
        Error_Handler();
    }

    // Configure Compare Unit 1 of Master timer to set TA1 and TB1 reset points
    compareConfig.CompareValue = half_period * period / 16000; // Set compare value, frequency 50%
    if (HAL_HRTIM_WaveformCompareConfig(&hhrtim1, HRTIM_TIMERINDEX_MASTER, HRTIM_COMPAREUNIT_1, &compareConfig) != HAL_OK)
    {
        Error_Handler();
    }
    if (HAL_HRTIM_TimeBaseConfig(&hhrtim1, HRTIM_TIMERINDEX_TIMER_A, &timeBaseConfig) != HAL_OK)
    {
        Error_Handler();
    }

    // Configure Timer A control parameters
    timerControl.UpDownMode = HRTIM_TIMERUPDOWNMODE_UP; // Set counting mode to up
    timerControl.TrigHalf = HRTIM_TIMERTRIGHALF_DISABLED; // Disable half-cycle trigger
    timerControl.GreaterCMP1 = HRTIM_TIMERGTCMP1_EQUAL; // Set compare condition to equal
    timerControl.DualChannelDacEnable = HRTIM_TIMER_DCDE_DISABLED; // Disable dual-channel DAC

    // Apply Timer A control configuration, handle error if fails
    if (HAL_HRTIM_WaveformTimerControl(&hhrtim1, HRTIM_TIMERINDEX_TIMER_A, &timerControl) != HAL_OK)
    {
        Error_Handler();
    }

    // Configure Compare Unit 1 of Timer A to reset TA1 before dead time
    timerConfig.InterruptRequests = HRTIM_TIM_IT_NONE; // Disable Timer A interrupt requests
    timerConfig.DMARequests = HRTIM_TIM_DMA_NONE;       // Disable Timer A DMA requests
    timerConfig.PushPull = HRTIM_TIMPUSHPULLMODE_DISABLED; // Disable push-pull mode
    timerConfig.FaultEnable = HRTIM_TIMFAULTENABLE_NONE;    // Disable faults
    timerConfig.FaultLock = HRTIM_TIMFAULTLOCK_READWRITE;   // Set fault lock to read/write
    timerConfig.DeadTimeInsertion = HRTIM_TIMDEADTIMEINSERTION_DISABLED; // Disable dead time insertion
    timerConfig.DelayedProtectionMode = HRTIM_TIMER_A_B_C_DELAYEDPROTECTION_DISABLED; // Disable delayed protection mode
    timerConfig.UpdateTrigger = HRTIM_TIMUPDATETRIGGER_NONE; // Disable update trigger
    timerConfig.ResetTrigger = HRTIM_TIMRESETTRIGGER_MASTER_PER; // Set reset trigger source to Master timer period
    timerConfig.ResetUpdate = HRTIM_TIMUPDATEONRESET_DISABLED; // Disable update on reset

	// Apply Compare Unit configuration for Timer A, handle error if fails
	if (HAL_HRTIM_WaveformTimerConfig(&hhrtim1, HRTIM_TIMERINDEX_TIMER_A, &timerConfig) != HAL_OK)
	{
	  Error_Handler();
	}


