Andrew0050/DP_STM32G474_StateM_20241107/Core/Src/function.c
    // Set Timer B's reset trigger source to Compare Unit 1 of Master timer
    timerConfig.ResetTrigger = HRTIM_TIMRESETTRIGGER_MASTER_CMP1;

    // Apply Compare Unit configuration for Timer B, handle error if fails
    if (HAL_HRTIM_WaveformTimerConfig(&hhrtim1, HRTIM_TIMERINDEX_TIMER_B, &timerConfig) != HAL_OK)
    {
        Error_Handler();
    }

    // Set Compare Unit 1 of Timer A, new compare value = (half_period * period / 16000) - dead_time
    compareConfig.CompareValue = half_period * period / 16000 - dead_time; // 7680 / frequency minus dead time 48%
    if (HAL_HRTIM_WaveformCompareConfig(&hhrtim1, HRTIM_TIMERINDEX_TIMER_A, HRTIM_COMPAREUNIT_1, &compareConfig) != HAL_OK)
    {
        Error_Handler();
    }
    // Set Compare Unit 2 of Timer A, set duty cycle to duty_cycle * period / 16000
    compareConfig.CompareValue = duty_cycle * period / 16000; // 3600 / period 36%
    compareConfig.AutoDelayedMode = HRTIM_AUTODELAYEDMODE_REGULAR;
    compareConfig.AutoDelayedTimeout = 0x0000;

    if (HAL_HRTIM_WaveformCompareConfig(&hhrtim1, HRTIM_TIMERINDEX_TIMER_A, HRTIM_COMPAREUNIT_2, &compareConfig) != HAL_OK)
    {
        Error_Handler();
    }
    // Configure output parameters for TA1 and TB1
    outputConfig.Polarity = HRTIM_OUTPUTPOLARITY_HIGH; // Set output polarity to high
    outputConfig.SetSource = HRTIM_OUTPUTSET_TIMPER;    // Set output set source to Master timer period
    outputConfig.ResetSource = HRTIM_OUTPUTRESET_TIMCMP1; // Set output reset source to Compare Unit 1
    outputConfig.IdleMode = HRTIM_OUTPUTIDLEMODE_NONE; // Set idle mode to none
    outputConfig.IdleLevel = HRTIM_OUTPUTIDLELEVEL_INACTIVE; // Set idle level to inactive
    outputConfig.FaultLevel = HRTIM_OUTPUTFAULTLEVEL_NONE; // Set fault level to none
    outputConfig.ChopperModeEnable = HRTIM_OUTPUTCHOPPERMODE_DISABLED; // Disable chopper mode
    outputConfig.BurstModeEntryDelayed = HRTIM_OUTPUTBURSTMODEENTRY_REGULAR; // Set burst mode entry to regular

    // Configure TA1 output, handle error if fails
    if (HAL_HRTIM_WaveformOutputConfig(&hhrtim1, HRTIM_TIMERINDEX_TIMER_A, HRTIM_OUTPUT_TA1, &outputConfig) != HAL_OK)
    {
        Error_Handler();
    }
    // Configure TB1 output, handle error if fails
    if (HAL_HRTIM_WaveformOutputConfig(&hhrtim1, HRTIM_TIMERINDEX_TIMER_B, HRTIM_OUTPUT_TB1, &outputConfig) != HAL_OK)
    {
        Error_Handler();
    }

    // Change ResetSource to Compare Unit 2 for TA2 and TB2 reset points
    outputConfig.ResetSource = HRTIM_OUTPUTRESET_TIMCMP2;

    // Configure TA2 output, handle error if fails
    if (HAL_HRTIM_WaveformOutputConfig(&hhrtim1, HRTIM_TIMERINDEX_TIMER_A, HRTIM_OUTPUT_TA2, &outputConfig) != HAL_OK)
    {
        Error_Handler();
    }
    // Configure TB2 output, handle error if fails
    if (HAL_HRTIM_WaveformOutputConfig(&hhrtim1, HRTIM_TIMERINDEX_TIMER_B, HRTIM_OUTPUT_TB2, &outputConfig) != HAL_OK)
    {
        Error_Handler();
    }

    if (HAL_HRTIM_TimeBaseConfig(&hhrtim1, HRTIM_TIMERINDEX_TIMER_B, &timeBaseConfig) != HAL_OK)
    {
        Error_Handler();
    }
    if (HAL_HRTIM_WaveformTimerControl(&hhrtim1, HRTIM_TIMERINDEX_TIMER_B, &timerControl) != HAL_OK)
    {
        Error_Handler();
    }
    // Set Compare Unit 1 of Timer B, set compare value to (half_period * period / 16000) - dead_time
    compareConfig.CompareValue = half_period * period / 16000 - dead_time; // 7680 / frequency minus dead time 48%
    if (HAL_HRTIM_WaveformCompareConfig(&hhrtim1, HRTIM_TIMERINDEX_TIMER_B, HRTIM_COMPAREUNIT_1, &compareConfig) != HAL_OK)
    {
        Error_Handler();
    }
    // Set Compare Unit 2 of Timer B, set duty cycle to duty_cycle * period / 16000
    compareConfig.CompareValue = duty_cycle * period / 16000; // 3600 / period 36%

    if (HAL_HRTIM_WaveformCompareConfig(&hhrtim1, HRTIM_TIMERINDEX_TIMER_B, HRTIM_COMPAREUNIT_2, &compareConfig) != HAL_OK)
    {
        Error_Handler();
    }

	/* USER CODE BEGIN HRTIM1_Init 2 */
	// Store global time base configuration
	pGlobalTimeBaseCfg = timeBaseConfig;

    // Start four PWM outputs (TA1, TA2, TB1, TB2)
    HAL_HRTIM_WaveformOutputStart(&hhrtim1, HRTIM_OUTPUT_TA1 | HRTIM_OUTPUT_TA2 | HRTIM_OUTPUT_TB1 | HRTIM_OUTPUT_TB2); // Enable all PWM outputs
    // Start Timer A and Timer B
    HAL_HRTIM_WaveformCounterStart(&hhrtim1, HRTIM_TIMERID_MASTER | HRTIM_TIMERID_TIMER_A | HRTIM_TIMERID_TIMER_B); // Start both PWM timers

	/* USER CODE END HRTIM1_Init 2 */
    HAL_HRTIM_MspPostInit(&hhrtim1);

}














